yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l101f2.h
#define MASK_ITC_SPR8_VECT28SPR  0x03
#define MASK_ITC_SPR8_VECT29SPR  0x0C


/*-------------------------------------------------------------------------
 *      SWIM register definitions
 *-----------------------------------------------------------------------*/
/* SWIM control status register */
__IO_REG8    (SWIM_CSR,    0x7F80, __READ_WRITE);


/*-------------------------------------------------------------------------
 *      DM register definitions
 *-----------------------------------------------------------------------*/
/* Breakpoint 1 register extended byte */
__IO_REG8    (DM_BK1RE,    0x7F90, __READ_WRITE);
/* Breakpoint 1 register high byte */
__IO_REG8    (DM_BK1RH,    0x7F91, __READ_WRITE);
/* Breakpoint 1 register low byte */
__IO_REG8    (DM_BK1RL,    0x7F92, __READ_WRITE);
/* Breakpoint 2 register extended byte */
__IO_REG8    (DM_BK2RE,    0x7F93, __READ_WRITE);
/* Breakpoint 2 register high byte */
__IO_REG8    (DM_BK2RH,    0x7F94, __READ_WRITE);
/* Breakpoint 2 register low byte */
__IO_REG8    (DM_BK2RL,    0x7F95, __READ_WRITE);
/* Debug module control register 1 */
__IO_REG8    (DM_CR1,      0x7F96, __READ_WRITE);
/* Debug module control register 2 */
__IO_REG8    (DM_CR2,      0x7F97, __READ_WRITE);
/* Debug module control/status register 1 */
__IO_REG8    (DM_CSR1,     0x7F98, __READ_WRITE);
/* Debug module control/status register 2 */
__IO_REG8    (DM_CSR2,     0x7F99, __READ_WRITE);
/* Enable function register */
__IO_REG8    (DM_ENFCTR,   0x7F9A, __READ_WRITE);


/*-------------------------------------------------------------------------
 *      Interrupt vector numbers
 *
 *  Note: The vector numbers listed in ST's manuals for STM8 are offset
 *        by 2 compared to the vector numbers used by EWSTM8.
 *-----------------------------------------------------------------------*/
#define FLASH_EOP_vector                      3 /* IRQ No. in STM8 manual:  1 */
#define FLASH_WR_PG_DIS_vector                3 /* IRQ No. in STM8 manual:  1 */
#define AWU_vector                            6 /* IRQ No. in STM8 manual:  4 */
#define EXTIB_vector                          8 /* IRQ No. in STM8 manual:  6 */
#define EXTID_vector                          9 /* IRQ No. in STM8 manual:  7 */
#define EXTI0_vector                         10 /* IRQ No. in STM8 manual:  8 */
#define EXTI1_vector                         11 /* IRQ No. in STM8 manual:  9 */
#define EXTI2_vector                         12 /* IRQ No. in STM8 manual: 10 */
#define EXTI3_vector                         13 /* IRQ No. in STM8 manual: 11 */
#define EXTI4_vector                         14 /* IRQ No. in STM8 manual: 12 */
#define EXTI5_vector                         15 /* IRQ No. in STM8 manual: 13 */
#define EXTI6_vector                         16 /* IRQ No. in STM8 manual: 14 */
#define EXTI7_vector                         17 /* IRQ No. in STM8 manual: 15 */
#define COMP_ITEN1_vector                    20 /* IRQ No. in STM8 manual: 18 */
#define COMP_ITEN2_vector                    20 /* IRQ No. in STM8 manual: 18 */
#define TIM2_BIF_vector                      21 /* IRQ No. in STM8 manual: 19 */
#define TIM2_OVR_UIF_vector                  21 /* IRQ No. in STM8 manual: 19 */
#define TIM2_TIF_vector                      21 /* IRQ No. in STM8 manual: 19 */
#define TIM2_CAPCOM_CC1IF_vector             22 /* IRQ No. in STM8 manual: 20 */
#define TIM2_CAPCOM_CC2IF_vector             22 /* IRQ No. in STM8 manual: 20 */
#define TIM3_BIF_vector                      23 /* IRQ No. in STM8 manual: 21 */
#define TIM3_OVR_UIF_vector                  23 /* IRQ No. in STM8 manual: 21 */
#define TIM3_TIF_vector                      23 /* IRQ No. in STM8 manual: 21 */
#define TIM3_CAPCOM_CC1IF_vector             24 /* IRQ No. in STM8 manual: 22 */
#define TIM3_CAPCOM_CC2IF_vector             24 /* IRQ No. in STM8 manual: 22 */
#define TIM4_TIF_vector                      27 /* IRQ No. in STM8 manual: 25 */
#define TIM4_UIF_vector                      27 /* IRQ No. in STM8 manual: 25 */
#define SPI_MODF_vector                      28 /* IRQ No. in STM8 manual: 26 */
#define SPI_OVR_vector                       28 /* IRQ No. in STM8 manual: 26 */
#define SPI_RXNE_vector                      28 /* IRQ No. in STM8 manual: 26 */
#define SPI_TXE_vector                       28 /* IRQ No. in STM8 manual: 26 */
#define SPI_WKUP_vector                      28 /* IRQ No. in STM8 manual: 26 */
#define USART_T_TC_vector                    29 /* IRQ No. in STM8 manual: 27 */
#define USART_T_TXE_vector                   29 /* IRQ No. in STM8 manual: 27 */
#define USART_R_IDLE_vector                  30 /* IRQ No. in STM8 manual: 28 */
#define USART_R_OR_vector                    30 /* IRQ No. in STM8 manual: 28 */
#define USART_R_PE_vector                    30 /* IRQ No. in STM8 manual: 28 */
#define USART_R_RXNE_vector                  30 /* IRQ No. in STM8 manual: 28 */
#define I2C_ADD10_vector                     31 /* IRQ No. in STM8 manual: 29 */
#define I2C_ADDR_vector                      31 /* IRQ No. in STM8 manual: 29 */
#define I2C_AF_vector                        31 /* IRQ No. in STM8 manual: 29 */
#define I2C_ARLO_vector                      31 /* IRQ No. in STM8 manual: 29 */
#define I2C_BERR_vector                      31 /* IRQ No. in STM8 manual: 29 */
#define I2C_BTF_vector                       31 /* IRQ No. in STM8 manual: 29 */
#define I2C_OVR_vector                       31 /* IRQ No. in STM8 manual: 29 */
#define I2C_RXNE_vector                      31 /* IRQ No. in STM8 manual: 29 */
#define I2C_SB_vector                        31 /* IRQ No. in STM8 manual: 29 */
#define I2C_STOPF_vector                     31 /* IRQ No. in STM8 manual: 29 */
#define I2C_TXE_vector                       31 /* IRQ No. in STM8 manual: 29 */
#define I2C_WUFH_vector                      31 /* IRQ No. in STM8 manual: 29 */

#ifdef __IAR_SYSTEMS_ICC__
#pragma language=restore
#endif

#endif    /* __IOSTM8L101F2_H__ */

/*----------------------------------------------
 *      End of file
 *--------------------------------------------*/
